{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "Active to Passive",
    "1": "Direct to Indirect Speech",
    "2": "Indirect to Direct Speech",
    "3": "Negative to Positive",
    "4": "Passive to Active",
    "5": "Positive to Negative"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Active to Passive": 0,
    "Direct to Indirect Speech": 1,
    "Indirect to Direct Speech": 2,
    "Negative to Positive": 3,
    "Passive to Active": 4,
    "Positive to Negative": 5
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.1",
  "vocab_size": 30522
}
